In [4]:
import numpy as np
import pandas as pd

#import the pandas library and aliasing as pd
s = pd.Series()
print(s)

#creating a series from ndarray
data = np.array(["apple","banana","cherry","grapes"])
s = pd.Series(data, index=[100,101,102,103])
print(s)

Series([], dtype: float64)
100     apple
101    banana
102    cherry
103    grapes
dtype: object

<ipython-input-4-7d4573c0c98c>:5: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s=pd.Series()

In [6]:
s = pd.Series(5, index=[0,1,2,3])
print(s)

#create a series from dict
data = {'apple':'fruit','donkey':'animal','count':2}
seriesfruits = pd.Series(data)
print(seriesfruits)

0    5
1    5
2    5
3    5
dtype: int64
apple      fruit
donkey    animal
count          2
dtype: object

In [12]:
#Create a Series from ndarray

data = np.array(["apple","banana","cherry","grapes"])
seriesfruits1 = pd.Series(data, index=[100,101,102,103])
print(seriesfruits1)

print(seriesfruits1[:2])# 1st 2 elements

#retrieve the last element
print(seriesfruits1[-1:])

print(seriesfruits['apple'])
print(seriesfruits['count'])

100     apple
101    banana
102    cherry
103    grapes
dtype: object
100     apple
101    banana
dtype: object
103    grapes
dtype: object
fruit
2

In [13]:
#Create a Series from ndarray

data = np.array(["apple","banana","cherry","grapes"])
seriesfruits1 = pd.Series(data, index=[100,101,102,103])
print(seriesfruits1)

print(seriesfruits1[:2])# 1st 2 elements

#retrieve the last element
print(seriesfruits1[-1:])

print(seriesfruits['apple'])
print(seriesfruits['count'])

print(seriesfruits1[102])

for item in seriesfruits1:
    print(item)

100     apple
101    banana
102    cherry
103    grapes
dtype: object
100     apple
101    banana
dtype: object
103    grapes
dtype: object
fruit
2
cherry
apple
banana
cherry
grapes

In [14]:
#dataframe from lists
data = [['ashwini',10.4],['akhil',9],['ramya',6]]
df = pd.DataFrame(data,columns=['Name','Years of experience'])

#df = pd.DataFrame(data,columns=['Name','Age'],dtype = float)
print(df)

#DataFrame from Dict of ndarray/ Lists
data1 = {'Name':['Praveen','Afsana','Aravind','Harish'],'Score':[56,78,89,20]}
df = pd.DataFrame(data1)
print(df)

      Name  Years of experience
0  ashwini                 10.4
1    akhil                  9.0
2    ramya                  6.0
      Name  Score
0  Praveen     56
1   Afsana     78
2  Aravind     89
3   Harish     20

In [17]:
data2 = [{'id':1,'name':'ashwini'},{'id':2,'name':'ramya','age':16}]
df = pd.DataFrame(data2) # there is no age value it prints NaN
print(df)

df1=pd.DataFrame(data2,index=['first','second'],columns=['id','name'])
print(df1)

   id     name   age
0   1  ashwini   NaN
1   2    ramya  16.0
        id     name
first    1  ashwini
second   2    ramya

In [69]:
import pandas as pd
#create first Dataframe using dictionary
info1 = pd.DataFrame({"x":[25,15,12,19],
                     "y":[45,67,23,45]})
# create second dataframe using dictionary
info2 = pd.DataFrame({"x":[25,15,45],
                     "y":[47,12,34],
                     "z":[38,12,45]})

#append info2 at end in info1
info1.append(info2, ignore_index = True)# ignore_index is take the index continuously without 0,1,2,for next array
print("max is:",info1.max())
print("min is:",info1.min())
print("count is:",info1.count())
print(info1.describe())

info1.sort_values('x')
info1.sort_values('x',ascending=False)

info2.head(1)
info2.tail(2)
info2.isnull()

#info1.groupby('x')
#for x in range(len(info1)):
  #print(info1.Loc[x])

max is: x    25
y    67
dtype: int64
min is: x    12
y    23
dtype: int64
count is: x    4
y    4
dtype: int64
               x          y
count   4.000000   4.000000
mean   17.750000  45.000000
std     5.619905  17.962925
min    12.000000  23.000000
25%    14.250000  39.500000
50%    17.000000  45.000000
75%    20.500000  50.500000
max    25.000000  67.000000

       x      y      z
0  False  False  False
1  False  False  False
2  False  False  False

In [67]:
import pandas as pd
import numpy as np
data={'Name':['ashwini','akhil','naveen','rama'],
      'Percentage':[90,70,20,80],
     'Course':['BE','B.Tech','M.Tech','phd']}
df = pd.DataFrame(data)

grouped = df.groupby('Course')
print(grouped['Percentage'].agg(np.min))

Course
B.Tech    70
BE        90
M.Tech    20
phd       80
Name: Percentage, dtype: int64

In [15]:
import pandas as pd
student_data1 = {'student_id':['s1','s2','s3','s4','s5'],'name':['Ashwini','Ramya','Akhil','Anjali','Arun'],'Marks':[100,90,89,100,90]}
sd = pd.DataFrame(student_data1)
print(sd)

student_data2 = {'student_id':['s1','s2','s3','s4','s5'],'name':['Dinesh','Raj','Priyanka','Omkar','Jim'],'Marks':[100,100,35,75,45]}
sd1 = pd.DataFrame(student_data2)
print(sd1)

sd.append(sd1,ignore_index=True)# combine two dataframes

  student_id     name  Marks
0         s1  Ashwini    100
1         s2    Ramya     90
2         s3    Akhil     89
3         s4   Anjali    100
4         s5     Arun     90
  student_id      name  Marks
0         s1    Dinesh    100
1         s2       Raj    100
2         s3  Priyanka     35
3         s4     Omkar     75
4         s5       Jim     45

  student_id      name  Marks
0         s1   Ashwini    100
1         s2     Ramya     90
2         s3     Akhil     89
3         s4    Anjali    100
4         s5      Arun     90
5         s1    Dinesh    100
6         s2       Raj    100
7         s3  Priyanka     35
8         s4     Omkar     75
9         s5       Jim     45

In [14]:
import pandas as pd
student_data1 =pd.DataFrame( {'student_id':['s1','s2','s3','s4','s5'],'name':['Ashwini','Ramya','Akhil','Anjali','Arun'],'Marks':[100,90,89,100,90]})


student_data2 =pd.DataFrame( {'student_id':['s1','s2','s3','s4','s5'],'name':['Dinesh','Raj','Priyanka','Omkar','Jim'],'Marks':[100,100,35,75,45]})


result = pd.concat([student_data1,student_data2])
print(result)

  student_id      name  Marks
0         s1   Ashwini    100
1         s2     Ramya     90
2         s3     Akhil     89
3         s4    Anjali    100
4         s5      Arun     90
0         s1    Dinesh    100
1         s2       Raj    100
2         s3  Priyanka     35
3         s4     Omkar     75
4         s5       Jim     45